back/app/controllers/admin/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 18 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 18
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 13 LIMIT 1
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 8 LIMIT 1
---
	def show
		@order = Order.find(params[:id])
		@order_details = @order.order_details
		@address = Address.find(@order.address_id)
		@payment = Payment.find(@order.payment_id)

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 20 LIMIT 1
---
	def destroy
		@order = Order.find(params[:id]);

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 20 LIMIT 1
---
	def ship_order
		@order = Order.find(params[:id]);