back/app/controllers/admin/products_controller.rb

    def create
        @product = Product.new(product_params)
        if @product.save
---
INSERT INTO `products` (`title`, `description`, `price`, `quantity`, `created_at`, `updated_at`, `image`) VALUES ('table3', 'table3 image', 333, 1, '2021-09-23 14:46:53.685174', '2021-09-23 14:46:53.685174', 'table.jpeg')

    def update
        @product = Product.find(params[:id])
        if @product.update(product_params)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
UPDATE `products` SET `products`.`title` = 'product2a', `products`.`description` = 'upd2a', `products`.`price` = 20, `products`.`quantity` = 200, `products`.`image` = NULL, `products`.`updated_at` = '2022-01-11 14:08:34.123697' WHERE `products`.`id` = 2

  def destroy
    @product = Product.find(params[:id])
    if @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 9 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 9