back/app/controllers/addresses_controller.rb

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = NULL LIMIT 1
---
  def set_default
    @new_address = get_address_with_auth_check
    @old_address = Address.find(params[:old_id])