back/app/controllers/addresses_controller.rb

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 12
---
	def find_by_user_id
		# logger.debug("user_id:"+ params[:user_id])
		@addresses = Address.where(user_id: params[:user_id])

SELECT 1 AS one FROM `addresses` WHERE `addresses`.`user_id` = 12 LIMIT 1
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 12
INSERT INTO `addresses` (`user_id`, `receiver`, `phone_number`, `post_code`, `detail_address`, `created_at`, `updated_at`, `default`) VALUES (12, 'test_recevier', '000-1111-2222', '120-0000', 'detail address', '2021-12-22 13:17:00.182218', '2021-12-22 13:17:00.182218', TRUE)
---
	def create
		@address = Address.new(address_params)
		if !Address.exists?(user_id: params[:user_id])
			@address.is_default = 1
		end
		if @address.save

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 1 LIMIT 1
---
	def show
		@address = Address.find(params[:id])

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 2 LIMIT 1
UPDATE `addresses` SET `addresses`.`receiver` = 'hahaha222', `addresses`.`phone_number` = '010-0000-0000222', `addresses`.`post_code` = '1300222', `addresses`.`detail_address` = 'detail address hahaha222', `addresses`.`updated_at` = '2021-12-12 11:18:20.869332' WHERE `addresses`.`id` = 5
---
	def update
		@address = Address.find(params[:id])
		if @address.update(address_params)

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 10 LIMIT 1
DELETE FROM `addresses` WHERE `addresses`.`id` = 2
---
	def destroy
		@address = Address.find(params[:id])
		if @address.destroy