back/app/controllers/application_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---
  def current_user
    if decoded_token.present?
      user_id = decoded_token[0]['user_id']
      @user = User.find_by(id: user_id)