back/app/controllers/carts_controller.rb

	def find_cart_items
		cart = Cart.find_by(user_id: params[:user_id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 12 LIMIT 1

	def get_checkout_info
		@cart = Cart.find_by(user_id: params[:user_id])
		raise ActiveRecord::RecordNotFound if @cart.blank?
		@cart_items = @cart.cart_items
		@address = Address.where("user_id = ? AND is_default = 1", params[:user_id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 12 LIMIT 1
SELECT `addresses`.* FROM `addresses` WHERE (user_id = '12' AND is_default = 1)

	def show_cart_products
		@products = Product.where(id: params[:ids])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 14 LIMIT 1

	def remove_from_cart
			@current_cart = Cart.find_by(user_id: params[:user_id])
			raise ActiveRecord::RecordNotFound if @current_cart.blank?
			@cart_item = @current_cart.cart_items.find_by(product_id: params[:product_id])
			if !@cart_item.destroy
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 12 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 8 AND `cart_items`.`product_id` = 14 LIMIT 1
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 43