back/app/controllers/orders_controller.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 12 LIMIT 1
INSERT INTO `orders` (`user_id`, `address_id`, `is_paid`, `created_at`, `updated_at`) VALUES (12, 13, FALSE, '2022-01-09 14:03:07.366097', '2022-01-09 14:03:07.366097')
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 12
INSERT INTO `orders` (`order_status`, `user_id`, `address_id`, `is_paid`, `created_at`, `updated_at`) VALUES ('0', 12, 8, FALSE, '2021-12-25 11:55:04.289132', '2021-12-25 11:55:04.289132')
SELECT `products`.* FROM `products` WHERE `products`.`id` = 14 LIMIT 1
UPDATE `orders` SET `orders`.`product_count` = 3, `orders`.`amount_total` = 50, `orders`.`updated_at` = '2021-12-26 11:45:17.778524' WHERE `orders`.`id` = 15
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 44
DELETE FROM `carts` WHERE `carts`.`id` = 8
---
	def create_order
		@current_cart = Cart.find_by(user_id: params[:user_id])
		raise ActiveRecord::RecordNotFound if @current_cart.blank?
		@cart_items = @current_cart.cart_items
		@new_order = Order.new
		@new_order.user_id = params[:user_id]
		@new_order.address_id = params[:address_id]
		@new_order.payment_id = params[:payment_id]
		@new_order.aasm_state = 'order_placed'
		@new_order.is_paid = 0
		@new_order.shipping_fee = params[:shipping_fee]
		Cart.transaction do
			@new_order.save!
			count = 0
			amount = 0
			@cart_items.each do |cart_item|
				image = set_order_image(@new_order.id, cart_item.product_id, cart_item.product.images[0])
				@new_order.create_detail_item(cart_item.product, cart_item.quantity, cart_item.price, '', image)
				count += cart_item.quantity
				amount += cart_item.quantity * cart_item.price
				@product = Product.find(cart_item.product_id)
				if @product.quantity < cart_item.quantity
					# TODO error handling
					raise "Order failed. ErrCode: xxx / ErrMessage: quantity not enough"
				else
					@product.update!(quantity: @product.quantity - cart_item.quantity)
				end
			end
			@new_order.update!(product_count: count, amount_total: amount)
			@current_cart.destroy!

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 12
---
	def get_orders_by_user_id
		@orders = Order.where(user_id: params[:user_id])
		if !@orders.blank?

SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 21
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 8 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 18
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 19 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 20
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 9 LIMIT 1
---
	def show_order_by_no
		@order = get_order_with_auth_check
		@order_details = @order.order_details
		@address = Address.find(@order.address_id)
		@payment = Payment.find(@order.payment_id)

SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 18
SELECT `products`.* FROM `products` WHERE `products`.`id` = 14 LIMIT 1
---
	def cancel_order
		@order = get_order_with_auth_check
		@order_details = @order.order_details
		Order.transaction do
			for detail in @order_details do
				@product = Product.find(detail.product_id)

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 20 LIMIT 1
---
		def get_order_with_auth_check
			if validate_user.blank?
					response_unauthorized
			else
				if !params[:order_no].blank?
					@order = Order.find_by!(order_no: params[:order_no])
				else
					@order = Order.find(params[:id])