back/app/controllers/orders_controller.rb

	def show
		@order = Order.find(params[:id])
		if @order.blank?
			render json: 'backend: error! no order!'
		else
			@order_details = @order.order_details
			@address = Address.find(@order.address_id)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 19 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 19
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`id` = 9 LIMIT 1

	def get_orders_by_user_id
		@orders = Order.where(user_id: params[:user_id])
		if @orders.blank?
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 12

	def destroy
		@order = Order.find(params[:id]);
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 19 LIMIT 1

	def pay_order
		@order = Order.find(params[:order_id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 21 LIMIT 1