back/app/controllers/orders_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1
---
  def create_order
    @user = User.find(params[:user_id])