back/app/controllers/products_controller.rb

    def add_to_cart
        @product = Product.find(params[:product_id])
        @current_cart = Cart.find_by(user_id: params[:user_id])
        # cart is not exist
        if @current_cart.blank?
            @new_cart = Cart.new(user_id: params[:user_id])
            Cart.transaction do
                @new_cart.save!
                @new_cart.add_product_to_cart(@product,params[:user_id])
            end
        else
            # cart is alreay exist
            @cart_item = @current_cart.cart_items.find_by(product_id: params[:product_id])
            if @cart_item.blank?
                @current_cart.add_product_to_cart(@product,params[:user_id])
            else
                new_count = @cart_item.quantity + 1
                @cart_item.update(quantity: new_count)
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 12 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2022-01-04 08:05:33.471807', '2022-01-04 08:05:33.471807', 12)
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 1 AND `cart_items`.`product_id` = 11 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 13 AND `cart_items`.`product_id` = 15 LIMIT 1
UPDATE `cart_items` SET `cart_items`.`quantity` = 2, `cart_items`.`updated_at` = '2021-11-03 06:02:15.806267' WHERE `cart_items`.`id` = 3

    def decrease_of_cart
        @current_cart = Cart.find_by(user_id: params[:user_id])
        raise ActiveRecord::RecordNotFound if @current_cart.blank?
        @cart_item = @current_cart.cart_items.find_by(product_id: params[:product_id])
        if @cart_item.quantity == 1
            @cart_item.destroy
        else
            new_count = @cart_item.quantity - 1
            @cart_item.update(quantity: new_count)
---
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 13 AND `cart_items`.`product_id` = 15 LIMIT 1
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 7
UPDATE `cart_items` SET `cart_items`.`quantity` = 2, `cart_items`.`updated_at` = '2022-01-09 13:07:37.791256' WHERE `cart_items`.`id` = 52