back/app/controllers/products_controller.rb

  def show
    @product = find_product
    @reviews = @product.reviews
    avg_rate = Review.where(product_id: @product.id).average('rate')
    # discount
    @product.discount = ProductsController.get_discount(@product)
    # related_products
    if !@product.tags.blank?
      segments, tags = set_tags_like @product.tags.split(',')
      @related_products = Product.where(
        '(' + segments.join(' OR ') + ' OR category_id = ?) AND is_available = 1 AND quantity > 0 AND id <> ?', *tags, @product.category_id, @product.id
      )
    else
      @related_products = Product.where('is_available = 1 AND quantity > 0 AND category_id = ? AND id <> ?',
                                        @product.category_id, @product.id)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 15 LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 14 LIMIT 1

  def add_to_cart
    user_id = decode_user_id(params[:user_id])
    @product = Product.find(params[:product_id])
    discount = ProductsController.get_discount(@product)
    @product.price = (@product.price * (1 - discount)).round(0)
    @current_cart = Cart.find_by(user_id: user_id)
    # cart is not exist
    if @current_cart.blank?
      @new_cart = Cart.new(user_id: user_id)
      Cart.transaction do
        @new_cart.save!
        @new_cart.add_product_to_cart(@product, user_id)
      end
    else
      # cart is alreay exist
      @cart_item = @current_cart.cart_items.find_by(product_id: @product.id)
      if @cart_item.blank?
        @current_cart.add_product_to_cart(@product, user_id)
      else
        new_count = @cart_item.quantity + 1
        @cart_item.update(quantity: new_count)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 15
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 8 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2021-11-03 06:05:47.628222', '2021-11-03 06:05:47.628222', 10)
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 1 AND `cart_items`.`product_id` = 14 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 1
UPDATE `cart_items` SET `cart_items`.`quantity` = 6, `cart_items`.`updated_at` = '2021-11-18 14:20:59.227790' WHERE `cart_items`.`id` = 12

  def decrease_of_cart
    user_id = decode_user_id(params[:user_id])
    product_id = decode_product_id(params[:product_id])
    @current_cart = Cart.find_by(user_id: user_id)
    raise ActiveRecord::RecordNotFound if @current_cart.blank?

    @cart_item = @current_cart.cart_items.find_by(product_id: product_id)
    if @cart_item.quantity == 1
      @cart_item.destroy
    else
      new_count = @cart_item.quantity - 1
      @cart_item.update(quantity: new_count)
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`user_id` = 8 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 1 AND `cart_items`.`product_id` = 14 LIMIT 1
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 15
UPDATE `cart_items` SET `cart_items`.`quantity` = 4, `cart_items`.`updated_at` = '2021-11-18 14:00:52.947665' WHERE `cart_items`.`id` = 7

  def find_product
    @product = if !params[:id].blank?
                 Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (14, 15, 11, 12)