back/app/controllers/users_controller.rb

  def create
    @user = User.find_by(email: params[:email])
    unless @user.present?
      @user = User.new(user_params)
      render response_unprocessable_entity(@user.errors) unless @user.save!
---
SELECT 1 AS one FROM `users` WHERE `users`.`email` = BINARY 'new@gmail.com' LIMIT 1
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `email`, `password_digest`) VALUES ('valtest', '2022-01-16 09:24:50.764948', '2022-01-16 09:24:50.764948', 'val@test.com', '$2a$12$wGAsUY7B80KywwjCDOJ6zO78pVd1sDMlaUxp7GoLjsM/9loujYumC')