back/app/controllers/users_controller.rb

  def current_user
    if decoded_token.present?
      user_id = decoded_token[0]['user_id']
      @user = User.find_by(id: user_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `email`, `is_admin`, `password_digest`) VALUES ('testmail', '2021-10-31 07:48:46.211580', '2021-10-31 07:48:46.211580', 'testmail@gmail.com', TRUE, '$2a$12$rqGbv9xV0fpwNfAplqmRKefX4hLKKSxv2NbseQo3.Tt1zfv5whT7m')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`name` = 'new11', `users`.`updated_at` = '2021-12-06 13:04:05.865181' WHERE `users`.`id` = 12

  def login
    current_user = User.find_by(email: params[:email], password: params[:password])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'aaa@gmail.com ' AND `users`.`password` = 'aaa' LIMIT 1

  def find_user_by_token
    tokenB = request.headers["Authorization"]
    token = tokenB[7,tokenB.length-7]
    current_user = User.find_by(token: token)
---
SELECT `users`.* FROM `users` WHERE `users`.`token` = 'Bearer 1C79d3nMmij3adgCaVTMsZuC' LIMIT 1