back/app/models/cart.rb

    def add_product_to_cart(product, user_id)
        ci = cart_items.build
        ci.product_id = product.id
        ci.price = product.price
        ci.quantity = 1
        ci.save
---
INSERT INTO `cart_items` (`cart_id`, `product_id`, `created_at`, `updated_at`, `price`) VALUES (1, 14, '2021-11-23 04:42:19.440446', '2021-11-23 04:42:19.440446', 333)