back/app/models/order.rb

	def create_detail_item(product, quantity, price, remark, image)
		di = order_details.build
		di.product_id = product.id
		di.product_title = product.title
		di.price = price
		di.quantity = quantity
		di.discount = product.discount
		di.subtotal = price * di.quantity
		di.remark = remark
    di.image = image
		di.save!
---
INSERT INTO `order_details` (`product_id`, `discount`, `subtotal`, `remark`, `created_at`, `updated_at`, `quantity`, `product_title`, `order_id`, `price`) VALUES (14, 1.0, 10, '', '2021-12-26 11:39:41.118260', '2021-12-26 11:39:41.118260', 1, 'table3', 12, 10)

	def pay!
		self.update_columns(is_paid: true)
---
UPDATE `orders` SET `orders`.`is_paid` = TRUE WHERE `orders`.`id` = 18